In [1]:
import pandas as pd
import numpy as np

In [2]:
train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

# clean train data

In [3]:
train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category_1          550068 non-null  int64
 9   Product_Category_2          376430 non-null  float64
 10  Product_Category_3          166821 non-null  float64
 11  Purchase                    550068 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [40]:
train['min'] = train['Age'].apply(lambda x: x[:-1] if '-' not in x else x.split('-')[0])
train['max'] = train['Age'].apply(lambda x: x[:-1] if '-' not in x else x.split('-')[1])

In [45]:
train['min'] = train['min'].astype(float)
train['max'] = train['max'].astype(float)

In [46]:
train['Age'] = (train['min'] + train['max'])/2

In [54]:
train['Stay_In_Current_City_Years'] = train['Stay_In_Current_City_Years'].apply(lambda x: '4' if x == '4+' else x)

In [56]:
train['Product_Category_2'] = train['Product_Category_2'].fillna(train['Product_Category_2'].mean())
train['Product_Category_3'] = train['Product_Category_3'].fillna(train['Product_Category_3'].mean())

In [58]:
train = train.drop(['min', 'max'], axis = 1)

In [63]:
clean_data = {"Gender" : {"M" : 0, "F" : 1}, "City_Category" : {"A" : 0, "B" : 1, "C" : 2}}

In [64]:
train = train.replace(clean_data)

In [77]:
train = train.drop(['User_ID', 'Product_ID'], axis = 1)

In [78]:
train.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1,8.5,10,0,2,0,3,9.842329,12.668243,8370
1,1,8.5,10,0,2,0,1,6.000000,14.000000,15200
2,1,8.5,10,0,2,0,12,9.842329,12.668243,1422
3,1,8.5,10,0,2,0,12,14.000000,12.668243,1057
4,0,55.0,16,2,4,0,8,9.842329,12.668243,7969

# clean test data

In [66]:
test['min'] = test['Age'].apply(lambda x: x[:-1] if '-' not in x else x.split('-')[0])
test['max'] = test['Age'].apply(lambda x: x[:-1] if '-' not in x else x.split('-')[1])

In [67]:
test['min'] = test['min'].astype(float)
test['max'] = test['max'].astype(float)

In [68]:
test['Age'] = (test['min'] + test['max'])/2

In [69]:
test['Stay_In_Current_City_Years'] = test['Stay_In_Current_City_Years'].apply(lambda x: '4' if x == '4+' else x)

In [70]:
test['Product_Category_2'] = test['Product_Category_2'].fillna(test['Product_Category_2'].mean())
test['Product_Category_3'] = test['Product_Category_3'].fillna(test['Product_Category_3'].mean())

In [71]:
test = test.drop(['min', 'max'], axis = 1)

In [72]:
test = test.replace(clean_data)

In [80]:
user = test.drop(['User_ID'], axis = 1)

In [81]:
product = test.drop(['Product_ID'], axis = 1)

In [82]:
test = test.drop(['User_ID', 'Product_ID'], axis = 1)

In [83]:
test.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,0,48.0,7,1,2,1,1,11.0,12.669454
1,0,30.5,17,2,0,0,3,5.0,12.669454
2,1,40.5,1,1,4,1,5,14.0,12.669454
3,1,40.5,1,1,4,1,4,9.0,12.669454
4,1,30.5,1,2,1,0,4,5.0,12.000000